Revit 2024 API
DisableAnalyticalModelCB Class
 Disable the analytical model for a structural wall.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public class DisableAnalyticalModelCB : FailureResolution
Visual Basic
Public Class DisableAnalyticalModelCB _
	Inherits FailureResolution
Visual C++
public ref class DisableAnalyticalModelCB : public FailureResolution
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FailureResolution
 Autodesk.Revit.DB.DisableAnalyticalModelCB
See Also
DisableAnalyticalModelCB Members
Autodesk.Revit.DB Namespace